; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	infrared3 - mode
	infrared1 - mode
	spectrograph0 - mode
	thermograph2 - mode
	GroundStation1 - direction
	Star2 - direction
	Star6 - direction
	Star3 - direction
	Star0 - direction
	Star9 - direction
	GroundStation4 - direction
	Star5 - direction
	Star8 - direction
	GroundStation7 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star9)
	(supports instrument1 infrared3)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared3)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 Star0)
	(supports instrument3 infrared1)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star9)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star5)
	(supports instrument6 spectrograph0)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation7)
	(calibration_target instrument6 Star8)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon15)
)
(:goal (and
	(pointing satellite1 Star0)
	(pointing satellite2 Star14)
	(have_image Phenomenon10 infrared1)
	(have_image Planet11 spectrograph0)
	(have_image Planet12 thermograph2)
	(have_image Star13 thermograph2)
	(have_image Star14 spectrograph0)
	(have_image Phenomenon15 thermograph2)
))

)

; plan
1. (turn_to satellite2 groundstation7 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 groundstation7)
   goals met: 0 of 8
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 8
3. (calibrate satellite2 instrument6 groundstation7)
   added: (calibrated instrument6)
   goals met: 0 of 8
4. (turn_to satellite2 planet11 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 planet11)
   goals met: 0 of 8
5. (take_image satellite2 planet11 instrument6 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 1 of 8
6. (turn_to satellite2 phenomenon15 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon15)
   goals met: 1 of 8
7. (turn_to satellite1 star0 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 star0)
   goals met: 2 of 8
8. (take_image satellite2 phenomenon15 instrument6 thermograph2)
   added: (have_image phenomenon15 thermograph2)
   goals met: 3 of 8
9. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 8
10. (calibrate satellite0 instrument1 star9)
   added: (calibrated instrument1)
   goals met: 3 of 8
11. (turn_to satellite0 phenomenon10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 8
12. (take_image satellite0 phenomenon10 instrument1 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 4 of 8
13. (turn_to satellite2 planet12 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 planet12)
   goals met: 4 of 8
14. (take_image satellite2 planet12 instrument6 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 5 of 8
15. (turn_to satellite2 star13 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 star13)
   goals met: 5 of 8
16. (take_image satellite2 star13 instrument6 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 6 of 8
17. (turn_to satellite2 star14 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star14)
   goals met: 7 of 8
18. (take_image satellite2 star14 instrument6 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 8 of 8
